Repository: ty154g/fpcupdeluxe-fastgit
Catalog: languages/fpcupdeluxe.*.po
Languages: ru

source: Add context for FPC and Lazarus files.
ru: Добавить контекст для файлов FPC и Lazarus.

source: Re-apply local changes when updating.
ru: Повторно применить локальные изменения при обновлении.

source: Always ask for confirmation.
ru: Всегда запрашивать подтверждение.

source: Auto-switch repo URL.
ru: Автопереключаемый URL репозитория

source: Docked Lazarus IDE.
ru: IDE Lazarus в едином окне.

source: Allow patching of sources by online patches.
ru: Разрешать патчить исходники онлайн-патчами.

source: Be extra verbose.
ru: Выводить более подробную информацию.

source: Use local repo-client.
ru: Использовать локальный клиент репозитория.

source: Build FPC unicode.
ru: Собрать юникодный FPC.

source: Only use fpcup bootstrappers.
ru: Использовать только fpcup bootstrapper.

source: Check for fpcupdeluxe updates.
ru: Проверить обновления fcupdeluxe.

source: Include Help.
ru: Включить справку.

source: Include LCL with cross-compiler.
ru: Включить LCL с кросс-компилятором.

source: Get package repositories.
ru: Получить репозитории пакетов.

source: Get FPC/Laz repositories.
ru: Получить репозитории FPC/Laz.

source: Save settings in fpcup-script.
ru: Сохранить настройки в fpcup-script.

source: Send location and install info.
ru: Отправить информацию о местоположении и установке.

source: Split FPC source and bins.
ru: Разделить исходники и бинарные файлы FPC.

source: Split Lazarus source and bins.
ru: Разделить исходники и бинарные файлы Lazarus.

source: Use system FPC for Lazarus.
ru: Использовать системный FPC для Lazarus.

source: FPC/Laz rebuild only.
ru: Только пересборка FPC/Laz.

source: Use jobs for GNU make.
ru: Использовать задания для GNU make.

source: Use wget/libcurl as downloader.
ru: Используйте wget/libcurl в качестве загрузчика.

# extrasettings.captionusesoftfloat80bit
source: Enable software emulation of 80 bit floats.
ru: Включить программную эмуляцию 80-битных плавающих значений.

source: Double clicking on FPC and Lazarus files will open Lazarus.
ru: Двойной щелчок по файлам FPC и Lazarus откроет Lazarus.

source: Fpcupdeluxe can re-apply the local changes automagically by using local auto-patch.
ru: Fpcupdeluxe может повторно применить локальные изменения автоматически, используя локальные автопатчи.

source: Show a confirmation dialog with yes/no before every build.
ru: Показывать диалоговое окно с подтверждением "да/нет" перед каждой сборкой.

source: Build a docked Lazarus IDE
ru: Собрать IDE Lazarus в едином окне

source: Fpcupdeluxe can patch the sources automagically by using online patches.
ru: Fpcupdeluxe может патчить источники автоматически, используя онлайн-патчи.

source: Use the repo-client by fpcupdeluxe.
ru: Использовать repo-клиент от fpcupdeluxe.

source: Build FPC unicode for better Delphi compatibility.
ru: Собрать юникодный FPC для лучшей совместимости с Delphi.

source: Check for updates of fpcupdeluxe binaries.
ru: Проверка обновлений бинарных файлов fpcupdeluxe.

source: Download whole repository, or only latest files.
ru: Загрузить весь репозиторий целиком, или только последние файлы.

source: Save the current install-settings in a fpclazup-script for later use.
ru: Сохранить текущие параметры установки в fpclazup-скрипте для дальнейшего использования.

source: Location and install info will be send to public central fpcupdeluxe server.
ru: Информация о местоположении и установке будет передана на публичный центральный сервер fpcupdeluxe.

source: Use the system wide install of FPC to build Lazarus.
ru: Используйте общесистемную установку FPC для сборки Lazarus.

# extrasettings.hintusesoftfloat80bit
source: Enable software emulation of 80 bit floats.
ru: Включить программную эмуляцию 80-битных плавающих значений.

source: FPCUPdeluxe can try to download them if available !
ru: FPCUPdeluxe может попробовать скачать их, если они доступны!

source: Going to auto-build all installed cross-compilers !
ru: Идет автоматическая сборка всех установленных кросс-компиляторов!

source: Checking FPC configfile [fpc.cfg] for cross-compilers in
ru: Проверка конфигурационного файла FPC [fpc.cfg] на наличие кросс-компиляторов

source: Found crosscompiler for
ru: Найден кросс-компилятор для

source: Going to update cross-compiler.
ru: Идет обновление кросс-компилятора.

source: Going to install a cross-compiler from available sources.
ru: Идет установка кросс-компилятора из доступных источников.

source: Please wait. Checking for updates.
ru: Пожалуйста, подождите. Проверка обновлений.

source: FPCUPdeluxe cannot be run inside the Downloads folder.
ru: FPCUPdeluxe не может быть запущен в папке "Загрузки".

source: This is NOT allowed by OSX security measures.
ru: Это НЕ разрешено мерами безопасности OSX.

source: Copy FPCUPdeluxe into its own directory and run from there.
ru: Скопируйте FPCUPdeluxe в собственную папку и запустите оттуда.

source: FPCUPdeluxe could not create its necessary setting-files.
ru: FPCUPdeluxe не смог создать свои необходимые файлы настроек.

source: Please check the folder permissions, and re-start.
ru: Пожалуйста, проверьте права доступа к папке и перезапустите снова.

source: Going to install %s and %s%s.
ru: Идет установка %s и %s%s.

source: Going to install the %s.
ru: Идет установка %s.

source: Going to install the cross-compiler for
ru: Устанавливаем кросс-компилятор для

source: Install directory
ru: Каталог установки

source: Current install directory
ru: Текущий каталог установки

source: Going to install/update FPC.
ru: Идет установка/обновление FPC.

source: Going to install/update FPC and Lazarus.
ru: Идет установка/обновление FPC и Lazarus.

source: Going to install/update Lazarus.
ru: Идет установка/обновление Lazarus.

source: Going to install/update module
ru: Идет установка/обновление модуля

source: Got settings from install directory
ru: Получены параметры из каталога установки

source: Looking for
ru: Ищем

source: Going to look for the right cross-bins. Can (will) take some time !
ru: Ищем правильный кросс-бинарник. Может (скорее всего) занять некоторое время!

source: Going to look for the right cross-libraries. Can (will) take some time !
ru: Ищем правильные кросс-библиотеки. Может (скорее всего) занять некоторое время!

source: Looking for FPCUPdeluxe cross-tools on GitHub (if any).
ru: Поиск FPCUPdeluxe кросс-инструменты на GitHub (если таковые имеются).

source: The building of a crosscompiler failed due to missing cross-tools.
ru: Не удалось собрать кросс-компилятор из-за отсутствия кросс-инструментов.

source: Do you want to continue ?
ru: Вы хотите продолжить?

source: Please quit FPCUPdeluxe.
ru: Пожалуйста, выйдите из FPCUPdeluxe.

source: Going to remove the cross-compiler for
ru: Собираемся удалить кросс-компилятор для

source: Going to remove module
ru: Идет удаление модуля

source: Please select a CPU target first.
ru: Сначала выберите целевой ЦП.

source: Please select a FPC and Lazarus target first
ru: Сначала выберите целевой FPC и Lazarus

source: Please select a FPC target first
ru: Сначала выберите целевой FPC

source: Please select a Lazarus target first
ru: Сначала выберите целевой Lazarus

source: Please select an OS target first.
ru: Сначала выберите целевую ОС.

source: Having a space in your install path is very ill-advised !
ru: Иметь пробел в пути установки очень не рекомендуется!

source: Trying to build the cross-compiler for
ru: Попытка собрать кросс-компилятор для

source: Going to update all crosscompilers
ru: Идет обновление всех кросс-компиляторов

source: New FPCUPdeluxe version available
ru: Доступна новая версия FPCUPdeluxe

source: No updates found.
ru: Обновления не найдены.

source: Aborted
ru: Прервано

source: cannot execute "%s"
ru: невозможно выполнить "%s"

source: cannot find executable "%s"
ru: невозможно найти исполняемый файл "%s"

source: executable "%s" is a directory
ru: исполняемый файл "%s" является папкой

source: executable "%s" lacks the permission to run
ru: исполняемый файл "%s" не имеет разрешения на запуск

source: Exit code %s
ru: Код выхода %s

source: freeing buffer lines: %s
ru: освобождение строк буфера: %s

source: missing directory "%s"
ru: отсутствует каталог "%s"

source: missing executable "%s"
ru: отсутствует исполняемый файл "%s"

source: Success
ru: Успешно

source: tool "%s" has no executable
ru: инструмент "%s" не имеет исполняемого файла

source: unable to execute: %s
ru: невозможно выполнить: %s

source: unable to read process ExitStatus
ru: невозможно прочитать процесс ExitStatus

source: E&xit
ru: Выйти &X

source: Exit
ru: Выход

source: &Save log
ru: Сохранить лог

source: Save As
ru: Сохранить как

source: Will install/update FPC and Lazarus stable and LAMW
ru: Установить/обновить стабильные FPC и Lazarus и LAMW

source: Basic
ru: Основное

source: Install/update FPC+Lazarus
ru: Установить/обновить FPC+Lazarus

source: Will install/update the selected version of both FPC and Lazarus.
ru: Установить/обновить выбранную версию FPC и Lazarus.

source: Only FPC
ru: Только FPC

source: Only install/update selected FPC version.
ru: Только установка/обновление выбранной версии FPC.

# tform1.bitbtnfpconlytag.caption
source: Add Tag
ru: Добавить тег

source: Add tag/url into FPC install list
ru: Добавить тег/url в список установки FPC

source: Set FPC hash in Setup+
ru: Установить хеш FPC в Установка+

source: Set FPC revision
ru: Установить ревизию FPC

source: STOP
ru: ОСТАНОВИТЬ

source: Try to stop current install process
ru: Попытка остановить текущий процесс установки

source: Only Lazarus
ru: Только Lazarus

source: Only install/update selected Lazarus version.
ru: Только установить/обновить выбранную версию Lazarus.

# tform1.bitbtnlazarusonlytag.caption
source: Add Tag
ru: Добавить тег

source: Add tag/url into Lazarus install list
ru: Добавить тег/url в список установки Lazarus

source: Set Lazarus hash in Setup+
ru: Установить хеш Lazarus в Установка+

source: Set Lazarus revision
ru: Установить ревизию Lazarus

source: Build Native Compiler
ru: Собрать нативный компилятор

source: Check Tools Location
ru: Проверьте расположение инструментов

source: Clear log
ru: Очистить логи

source: Create Lazarus Configuration
ru: Создание конфигурации Lazarus

source: Get OpenSSL by Browser
ru: Получить OpenSSL через браузер

source: Set install path
ru: Выбрать путь установки

source: Install module
ru: Установить модуль

source: Install the selected module.
ru: Установить выбранный модуль.

source: Email log
ru: Отправить логи по почте

source: Send email to fpcup maintainer containing Commandscreen output.
ru: Отправить электронное письмо сопровождающему fpcup, содержащее вывод экрана команд.

source: Setup+
ru: Установка+

source: Open the extended settings form.
ru: Открыть форму расширенных настроек.

source: Uninstall module
ru: Удалить модуль

source: Uninstall the selected module.
ru: Удалить выбранный модуль.

source: Update Lazarus Makefiles
ru: Обновление файлов Make Lazarus

source: Update all
ru: Обновить все

source: Auto-update all installed cross-compilers.
ru: Автоматическое обновление всех установленных кросс-компиляторов.

source: Install compiler
ru: Установить компилятор

source: Install the selected CPU-OS cross-compiler.
ru: Установить выбранный CPU-OS кросс-компилятор.

source: Remove compiler
ru: Удалить компилятор

source: Remove the selected CPU-OS cross-compiler.
ru: Удалить выбранный CPU-OS кросс-компилятор.

source: Set subarch
ru: Установите субархитектуру

source: Select a subarch for embedded target.
ru: Выберите субархитектуру для встроенной цели.

source: Auto clear
ru: Автоочистка

source: Check Makefile FPC
ru: Проверить Makefile FPC

source: Check Makefile Lazarus
ru: Проверить Makefile Lazarus

source: Re-create startup scripts
ru: Пересоздать скрипты запуска

source: Cross
ru: Кросс

source: Get FPC for ESP32 [lx6] boards
ru: Получите FPC для ESP32 [lx6] плат

source: Extras
ru: Дополнительно

source: Fixes
ru: Фиксы

source: Will install/update current fixes versions of both FPC and Lazarus
ru: Установить/обновить fixes версию FPC и Lazarus

source: FPC revision history
ru: История ревизий FPC

# tform1.fpctaglabel.caption
source: FPC version
ru: Версия FPC

# tform1.fpcversionlabel.caption
source: FPC version
ru: Версия FPC

source: History
ru: История

source: Directory to install FPC and Lazarus
ru: Каталог для установки FPC и Lazarus

source: Lazarus revision history
ru: История ревизий Lazarus

# tform1.lazarustaglabel.caption
source: Lazarus version
ru: Версия Lazarus

# tform1.lazarusversionlabel.caption
source: Lazarus version
ru: Версия Lazarus

# tform1.listboxfpchistorynew.columns[0].caption
source: Hash
ru: Хеш

# tform1.listboxfpchistorynew.columns[1].caption
source: Rev-name
ru: Название ревизии

# tform1.listboxfpchistorynew.columns[2].caption
source: Date
ru: Дата

# tform1.listboxlazarushistorynew.columns[0].caption
source: Hash
ru: Хеш

# tform1.listboxlazarushistorynew.columns[1].caption
source: Rev-name
ru: Название ревизии

# tform1.listboxlazarushistorynew.columns[2].caption
source: Date
ru: Дата

source: About Up
ru: О приложении

source: Chinese (CN)
ru: Китайский (CN)

source: Dutch (NL)
ru: Немецкий (NL)

source: Will show info and error
ru: Будет показана информация и ошибка

source: English (EN)
ru: Английский (EN)

source: &File
ru: &Файл

source: Languages
ru: Языки

source: Issues
ru: Проблемы

source: FPC bugs
ru: Ошибки FPC

source: French (F)
ru: Французский (F)

source: Russian (RU)
ru: Русский (RU)

source: German (D)
ru: Немецкий (D)

source: Help
ru: Помощь

source: Up Lazarus forum
ru: Форум Lazarus

source: Up GitHub issues
ru: Issues на GitHub

source: Korean (KR)
ru: Корейский (KR)

source: Lazarus bugs
ru: Баги Lazarus

source: Modules
ru: Модули

source: Online docs
ru: Онлайн документация

source: Get the mORMot2 for FPC
ru: Получить mORMot2 для FPC

source: Ukrainian (UK)
ru: Украинский (UK)

source: Online Wiki
ru: Онлайн Вики

source: Will install/update the Online Package Manager
ru: Будет установлен/обновлен Онлайн Менеджер Пакетов

source: Get FPC for armv6m RPi Pico
ru: Получить FPC для armv6m RPi Pico

source: CPU
ru: ЦП

source: OS
ru: ОС

# tform1.realfpcurl.hint
source: Double click to allow editing
ru: Двойной клик, чтобы разрешить редактирование

# tform1.reallazurl.hint
source: Double click to allow editing
ru: Двойной клик, чтобы разрешить редактирование

source: Stable
ru: Стабильный

source: Will install/update stable versions of both FPC and Lazarus
ru: Установить/обновить стабильную версию FPC и Lazarus

source: Sitting and waiting
ru: Сидите и ждите

source: Tags
ru: Теги

source: Trunk
ru: Транк

source: Will install/update trunk version of both FPC and Lazarus.
ru: Установить/обновить транковую версию FPC и Lazarus.

source: Install baremetal Ultibo for RPi3
ru: Установить baremetal Ultibo для RPi3

source: Install FPC and Lazarus for Web Assembly
ru: Установить FPC и Lazarus для Web Assembly

source: Get FPC for SAMD51 embedded on Wio Terminal
ru: Получите FPC для SAMD51, встроенного в Wio Terminal

source: Add FPC patch
ru: Добавить патч FPC

source: Add Laz. patch
ru: Добавить патч Lazarus

source: List All
ru: Показать все

source: Rem. FPC patch
ru: Удалить патч FPC

source: Rem. Laz. patch
ru: Удалить патч Lazarus

source: Tools
ru: Инструменты

source: Compiler
ru: Компилятор

source: Libraries
ru: Библиотеки

source: Advanced Settings
ru: Расширенные настройки

# tform2.chkfpcdebug.caption
source: Debug
ru: Отладка

# tform2.chklazarusdebug.caption
source: Debug
ru: Отладка

# tform2.editbinlocation.hint
source: Double click to clear
ru: Щелкните дважды для очистки

# tform2.editcompileroverride.hint
source: Double click to clear
ru: Щелкните дважды для очистки

# tform2.editliblocation.hint
source: Double click to clear
ru: Щелкните дважды для очистки

source: Proxy settings
ru: Настройка Proxy

source: Miscellaneous settings
ru: Различные настройки

source: Options Override
ru: Переопределение параметров

source: Branch and revision
ru: Ветка и ревизия

source: Pre and post install scripts
ru: Скрипты до и после установки

source: Source patching
ru: Патчинг исходников

source: HTTP proxy URL:
ru: URL-адрес HTTP-прокси:

source: HTTP proxy port:
ru: Порт HTTP прокси:

source: HTTP proxy username:
ru: Имя пользователя HTTP-прокси:

source: HTTP proxy password:
ru: Пароль HTTP-прокси:

source: Compiler Override
ru: Переопределение компилятора

source: Select CPU
ru: Выберите ЦП

source: Cross Build Options Override (i.e. -CfSoft)
ru: Переопределение параметров кросс-компиляции (т.е. -CfSoft)

source: FPC branch/tag
ru: FPC ветка/тег

source: FPC options
ru: Опции FPC

source: FPC hash
ru: Хеш FPC

source: Laz. branch/tag
ru: Ветка/тег Laz.

source: Laz. options
ru: Опции Lazarus

source: Laz. hash
ru: Хеш Лаз.

source: Select OS
ru: Выберите ОС

source: ARM target
ru: Цель ARM

source: Search options
ru: Опции поиска

source: Select subarch
ru: Выбрать субархитектуру

source: CPU/OS
ru: ЦП/ОС

source: Subarch
ru: Субархитектура
